# Використовуємо офіційний образ Node.js як базовий
FROM node:18-alpine

# Встановлюємо робочу директорію в контейнері
WORKDIR /app

# Копіюємо package.json і package-lock.json (якщо є) до робочої директорії
COPY package*.json ./

# Встановлюємо залежності
RUN npm install

# Копіюємо решту файлів проекту до робочої директорії
COPY . .

# Збираємо Vue.js додаток для продакшн
RUN npm run build

# Вказуємо на порт, який буде використовуватися додатком
EXPOSE 8080

# Команда для запуску додатка
CMD ["npm", "run", "serve"]
